Revit 2027 API
PipePressureDropData.RelativeRoughness Property
 The relative roughness of the pipe.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double RelativeRoughness { get; set; }
Public Property RelativeRoughness As Double
	Get
	Set
public:
property double RelativeRoughness {
	double get ();
	void set (double value);
}
member RelativeRoughness : float with get, set
Property Value
Double
See Also
Reference
PipePressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace